{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 128, "activation": "relu", "input_dtype": "float32", "nb_col": 7, "W_constraint": {"axis": 0, "m": 3, "name": "MaxNorm"}, "activity_regularizer": null, "border_mode": "same", "nb_row": 7, "batch_input_shape": [null, 10, 10, 3], "W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "trainable": true, "bias": true, "dim_ordering": "th", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_9"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_7"}}, {"class_name": "Dense", "config": {"activation": "relu", "W_regularizer": null, "input_dim": 3840, "W_constraint": {"axis": 0, "m": 3, "name": "MaxNorm"}, "activity_regularizer": null, "b_constraint": null, "output_dim": 10, "b_regularizer": null, "trainable": true, "bias": true, "init": "glorot_uniform", "name": "dense_15"}}, {"class_name": "Dense", "config": {"activation": "softmax", "W_regularizer": null, "input_dim": 10, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 2, "b_regularizer": null, "trainable": true, "bias": true, "init": "glorot_uniform", "name": "dense_16"}}]}